[
   {
      "Id": 1,
      "Title": "Knockout.js für .NET Entwickler - Teil 1",
      "Message":"Johannes Hoppe möchte Sie mitnehmen auf eine Reise in die Welt von Knockout.js. Der Ausflug beginnt mit einem leeren ASP.NET MVC & WebAPI-Projekt und endet mit einem detaillierten Formular, welches die Möglichkeiten des MVVM-Patterns auslotet. Die aufeinander aufbauenden Beispiele werden live entwickelt und verständlich erläutert. Johannes sieht sich als Verfechter von sauberem JavaScript-Code. Daher dürfen Sie praxisnahe und modulare Beispiele auf Basis von jQuery und require.js erwarten.",
      "Added": "2013-05-27T00:00:00",
      "Categories":[]
   },
   {
      "Id": 2,
      "Title": "Knockout.js für .NET Entwickler - Teil 2",
      "Message": "Aufbauend auf den Erkenntnissen des ersten Webinars wird das bestehende ASP.NET MVC-Projekt ausgebaut. Der Code wird weiter modularisiert und die Vorteile des MVVM-Patterns werden deutlich. Die Liste erhält eine Detailansicht und ein Formular zum Editieren der Daten. Johannes Hoppe erläutert bekannte Vorgehensweisen und JavaScript-Patterns, die für eine robuste Anwendung notwendig sind.",
      "Added": "2013-06-11T00:00:00",
      "Categories":[]
   },
   {
      "Id": 3,
      "Title": "ASP.NET Web API - Teil 1",
      "Message": "Das Web ist längst zu seinen Wurzeln zurückgekehrt und spricht „REST“. Flickr, Twitter, Google, Dopbox, eBay und viele weitere haben das Programmierparadigma für ihre Schnittstellen wieder entdeckt. Mit der ASP.NET WebAPI hat Microsoft auf den Trend reagiert und aus seinen Fehlern gelernt.",
      "Added": "2013-08-13T00:00:00",
      "Categories":[]
   },
   {
      "Id": 4,
      "Title": "ASP.NET Web API - Teil 2",
      "Message": "Aufbauend auf den Erkenntnissen des ersten Webinars wird das entstandene ASP.NET Web API Projekt weiter ausgebaut. Durch die Anpassung von Routen und HTTP-Befehlen wird die Anwendung stetig im Sinne von REST weiterentwickelt. Johannes Hoppe demonstriert anhand bekannter APIs, wo die gefährlichsten API Anti-Patterns zu finden sind und wie man Response Codes, Caching und Hypermedia korrekt einsetzen sollte.",
      "Added": "2013-08-27T00:00:00",
      "Categories":[]
   },
   {
      "Id": 5,
      "Title": "jQuery 2013 - Teil 1",
      "Message": "jQuery steht nicht nur für etwas AJAX, ein paar schicke Animationen und kostenlosen Plugins. Das Framework ist aktueller denn je und glänzt in vielen neuen Anwendungsfällen. Es unterstützt die neuesten Frameworks für Web und Mobile, welche Ihnen Johannes Hoppe vorstellen wird.",
      "Added": "2013-09-12T00:00:00",
      "Categories":[]
   },
   {
      "Id": 6,
      "Title": "jQuery 2013 - Teil 2",
      "Message": "Aufbauend auf den Erkenntnissen des ersten Webinars weiht Johannes Hoppe Sie in tiefergehende Details zu jQuery ein. Sie lernen, wie man eigene, wiederverwertbare Plugins schreibt und dabei die gängigsten Fehler vermeidet. Mit diesem Rüstzeug ausgestattet, sind Sie in der Lage, moderne Oberflächen mit den Mitteln von HTML5 und JavaScript zu gestalten.",
      "Added": "2013-09-26T00:00:00",
      "Categories":[]
   },
   {
      "Id": 7,
      "Title": "Require.js & Prinzipien für modulares JavaScript - Teil 1",
      "Message": "Der Schlüssel zum Erfolg ist der Einsatz von modularen Prinzipien, welche unter anderem durch JavaScript-Loader wie require.js realisiert werden. Mit 0% PowerPoint und 100% Browser stellt Johannes Hoppe seine persönlichen Best-Practices für JavaScript vor.",
      "Added": "2013-09-19T00:00:00",
      "Categories":[]
   },
   {
      "Id": 8,
      "Title": "Require.js & Prinzipien für modulares JavaScript - Teil 2",
      "Message": "Aufbauend auf den Erkenntnissen des ersten Webinars kommt Require.js auf den Prüfstand. Welche weiteren Modul-Loader gibt es? Wie erreicht man eine friedliche Koexistenz? Wie entwickelt man Bibliotheken und Plugins für alle Welten?",
      "Added": "2013-10-02T00:00:00",
      "Categories":[]
   }
]